## Plan Result (prod-shutter)




<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.shutter.azurerm_cdn_endpoint.shutter_endpoint[&#34;vh-admin-web&#34;]
  * module.shutter.azurerm_cdn_endpoint_custom_domain.this[&#34;vh-admin-web&#34;]
  * module.shutter.azurerm_cdn_endpoint_custom_domain.this[&#34;vh-video-web&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.shutter.azurerm_cdn_endpoint.shutter_endpoint["vh-admin-web"] will be created
  + resource "azurerm_cdn_endpoint" "shutter_endpoint" {
      + content_types_to_compress     = (known after apply)
      + fqdn                          = (known after apply)
      + id                            = (known after apply)
      + is_compression_enabled        = false
      + is_http_allowed               = false
      + is_https_allowed              = true
      + location                      = "westus"
      + name                          = "hmcts-admin-shutter-prod"
      + origin_host_header            = "hmctsvhadminwshutterprod.z33.web.core.windows.net"
      + origin_path                   = (known after apply)
      + probe_path                    = (known after apply)
      + profile_name                  = "hmcts-shutter-vh-admin-web"
      + querystring_caching_behaviour = "IgnoreQueryString"
      + resource_group_name           = "sds-platform-prod-rg"
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + origin {
          + host_name  = "hmctsvhadminwshutterprod.z33.web.core.windows.net"
          + http_port  = 80
          + https_port = 443
          + name       = "hmctsvhadminwshutterprod-z33-web-core-windows-net"
        }
    }

  # module.shutter.azurerm_cdn_endpoint_custom_domain.this["vh-admin-web"] will be created
  + resource "azurerm_cdn_endpoint_custom_domain" "this" {
      + cdn_endpoint_id = (known after apply)
      + host_name       = "admin.hearings.reform.hmcts.net"
      + id              = (known after apply)
      + name            = "admin-hearings-reform-hmcts-net"
    }

  # module.shutter.azurerm_cdn_endpoint_custom_domain.this["vh-video-web"] will be created
  + resource "azurerm_cdn_endpoint_custom_domain" "this" {
      + cdn_endpoint_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-vh-video-web/endpoints/hmcts-video-shutter-prod"
      + host_name       = "video.hearings.reform.hmcts.net"
      + id              = (known after apply)
      + name            = "video-hearings-reform-hmcts-net"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":448,"Program":"tfcmt","SHA1":"","Target":"prod-shutter","Vars":{}} -->